#!/bin/bash
# -------------------------------------------------------------------
# lyrset_set_LOG.sh
# -------------------------------------------------------------------

#:begin
echo '---------------------------------------------'
echo ' set_LOG '
echo '---------------------------------------------'
# Каталог журналов
LOG_DIR=""
# Файл журнала: каталог+имя+расширение
LOG_FILE=""
# Параметры журнала
LOG_OPT="1 1"
# Файл скрипта: каталог+имя+расширение
LOG_SHFULLNAME=""
# Файл скрипта: имя+расширение
LOG_SHBASENAME=""
# Файл скрипта: имя
LOG_SHFILENAME=""

#:Exit

