#!/bin/bash
# -------------------------------------------------------------------
# ubuntu_group_adduser.sh
# -------------------------------------------------------------------

#:begin

# Добавить ранее созданного пользователя в эту группу:
sudo usermod -a -G _DATA_w lyr
# Добавить ранее созданного пользователя в эту группу:
sudo usermod -a -G _DATA_r lyr

# Добавить ранее созданного пользователя в эту группу:
sudo usermod -a -G _LYRS_w lyr
# Добавить ранее созданного пользователя в эту группу:
sudo usermod -a -G _LYRS_r lyr

#:Exit

