#!/bin/bash
# -----------------------------------------------
# LYRDateTime.sh
# -----------------------------------------------

#:begin
# echo '01.НАЗВАНИЕ'
# echo '    *** - ***'

# echo '02.СИНТАКСИС'
# echo '    *** [параметры] ***'

# echo '03.ОПИСАНИЕ'
# echo '    ***'

#--------------------------------------------------------------------------------
# 
#--------------------------------------------------------------------------------
function YYYYMMDDHHMMSS { #
#beginfunction
    printf "%(%Y%m%d%H%M%S)T"
    return 0
}
#endfunction

#--------------------------------------------------------------------------------
# 
#--------------------------------------------------------------------------------
function DateTime { # format: str
#beginfunction
    FORMAT="$1"
    printf "%($FORMAT)T"
    return 0
}
#endfunction

#:Exit
