#!/bin/bash
# -----------------------------------------------
# LYRStrUtils.sh
# -----------------------------------------------

#:begin
# echo '01.НАЗВАНИЕ'
# echo '    *** - ***'

# echo '02.СИНТАКСИС'
# echo '    *** [параметры] ***'

# echo '03.ОПИСАНИЕ'
# echo '    ***'

#--------------------------------------------------------------------------------
# procedure LYRStrUtils
#--------------------------------------------------------------------------------
function LYRStrUtils {
#beginfunction
    echo LYRStrUtils

    return 0
}
#endfunction

#:Exit
